sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
  <!-- Bottom Actions -->
  <div class="bottom-bar">
    <button class="action-btn btn-start" onclick="start()">
      開始
    </button>
    <button class="action-btn btn-stop" onclick="stop()">
      停止
    </button>
  </div>
</div>

<!-- VIEW: SETTINGS -->
<div id="view-settings" style="display:none; padding-bottom:40px;">
  <div class="header" style="display:flex; align-items:center; gap:10px;">
    <button onclick="showMain()" style="background:none; border:none; color:var(--text-main); cursor:pointer; padding:0; font-size:2rem; font-weight:bold;">
      ←
    </button>
    <h1>詳細設定</h1>
  </div>
  
  <div class="card card-settings">
    <div class="setting-item">
      <span class="s-label">システム情報</span>
      <div style="margin-top:8px; font-size:0.9rem; color:var(--text-sub);">
        <div>Version: <span style="font-family:monospace;">1.44</span></div>
        <div>Build: <span style="font-family:monospace;">{{BUILD_TIME}}</span></div>
        <div>IP: <span style="font-family:monospace;" id="ip-disp">...</span></div>
      </div>
    </div>
    
    <div class="setting-item" style="flex-direction:row; align-items:center; justify-content:space-between;">
      <span class="s-label">保持時間 (秒)</span>
      <input type="number" id="inp-hold" value="0.5" step="0.1" style="width:80px; padding:12px; border-radius:12px; border:1px solid #ddd; text-align:center; font-size:1.1rem; font-weight:700;" onchange="saveHold(this.value)">
    </div>

    <div class="setting-item" style="flex-direction:row; align-items:center; justify-content:space-between;">
      <span class="s-label">到達時間 (秒)</span>
      <input type="number" id="inp-reach" value="0.5" step="0.1" style="width:80px; padding:12px; border-radius:12px; border:1px solid #ddd; text-align:center; font-size:1.1rem; font-weight:700;" onchange="saveReach(this.value)">
    </div>

    <div class="setting-item" style="flex-direction:row; align-items:center; justify-content:space-between;">
      <span class="s-label">外部出力 (Pin 13)</span>
      <label class="switch">
        <input type="checkbox" id="chk-pin13" onchange="togglePin13(this)">
        <span class="slider round"></span>
      </label>
    </div>
    
    <!-- 位置補正スライダー -->
    <div class="setting-item">
      <div class="s-header">
        <span class="s-label">位置補正 (-90 ~ +90)</span>
        <span class="s-val" id="offset-disp">0</span>
      </div>
      <input type="range" min="-90" max="90" value="0" step="1" id="inp-offset" oninput="updateAngleOffset(this.value)" style="width:100%;">
      <div style="font-size:0.8rem; color:var(--text-sub); margin-top:4px;">
        システム全体の角度を一括調整します
      </div>
    </div>
    
    <div class="setting-item">
      <div class="s-header">
        <span class="s-label">全サーボ同時調整 (90-270度)</span>
        <span class="s-val" id="all-servo-val">270°</span>
      </div>
      <input type="range" min="90" max="270" value="270" step="1" oninput="setAllServos(this.value)" style="width:100%;">
    </div>

    <div class="setting-item">
      <div class="s-header">
        <span class="s-label">サーボ1 (GPIO 18)</span>
        <span class="s-val" id="servo1-val">270°</span>
      </div>
      <input type="range" min="90" max="270" value="270" step="1" oninput="setServo(1, this.value)" style="width:100%;">
    </div>

    <div class="setting-item">
      <div class="s-header">
        <span class="s-label">サーボ2 (GPIO 26)</span>
        <span class="s-val" id="servo2-val">270°</span>
      </div>
      <input type="range" min="90" max="270" value="270" step="1" oninput="setServo(2, this.value)" style="width:100%;">
    </div>

    <div class="setting-item">
      <div class="s-header">
        <span class="s-label">サーボ3 (GPIO 27)</span>
        <span class="s-val" id="servo3-val">270°</span>
      </div>
      <input type="range" min="90" max="270" value="270" step="1" oninput="setServo(3, this.value)" style="width:100%;">
    </div>
  </div>
</div>

<!-- VIEW: HISTORY -->
<div id="view-history" style="display:none; padding-bottom:40px;">
  <div class="header" style="display:flex; align-items:center; gap:10px;">
    <button onclick="showMain()" style="background:none; border:none; color:var(--text-main); cursor:pointer; padding:0; font-size:2rem; font-weight:bold;">
       ←
    </button>
    <h1>履歴</h1>
  </div>
  <div id="history-list" class="card" style="padding:10px 20px;">
    <div style="text-align:center; padding:20px; color:#888;">読み込み中...</div>
  </div>
</div>

<!-- Completion Modal -->
<div class="completion-modal" id="completion-modal">
  <div class="completion-content">
    <div class="completion-title">完成！</div>
    <div class="completion-details">
      <div class="detail-row">
        <span class="detail-label">プリセット</span>
        <span class="detail-value" id="detail-preset">-</span>
      </div>
      <div class="detail-row">
        <span class="detail-label">強さ</span>
        <span class="detail-value" id="detail-strength">-</span>
      </div>
      <div class="detail-row">
        <span class="detail-label">回数</span>
        <span class="detail-value" id="detail-count">-</span>
      </div>
    </div>
    <button class="completion-btn" onclick="closeCompletionModal()">OK</button>
  </div>
</div>

<script>
let tgtCount = 3;
let lastStatus = "IDLE";
let currentPresetName = "ふつう"; // 初期値

// Animation Variables
let isRunning = false;
let isManualStop = false; 
let sessionTotalDur = 0; // 初期設定修正 
let sessionStartTime = 0;
let lastStartAction = 0; 

// 完了画面用
let runPreset = "";
let runStrength = 0;
let runCount = 0;

document.getElementById('ip-disp').innerText = window.location.hostname;

function fetchSettings() {
  fetch('/api/settings?load=1')
    .then(r=>r.json())
    .then(d=>{
      if(d.hold) document.getElementById('inp-hold').value = d.hold;
      if(d.reach) document.getElementById('inp-reach').value = d.reach;
      if(d.pin13 !== undefined) document.getElementById('chk-pin13').checked = (d.pin13 == 1);
      
      updTimeDisp();
      setTimeout(() => document.body.classList.add('ready'), 50);
    }).catch(e => {
        updTimeDisp();
        document.body.classList.add('ready');
    });
}
fetchSettings();

function saveHold(v) { fetch('/api/settings?hold=' + v).then(()=>updTimeDisp()); }
function saveReach(v) { fetch('/api/settings?reach=' + v).then(()=>updTimeDisp()); }
function togglePin13(el) { fetch('/api/pin13?val=' + (el.checked ? 1 : 0)); }

