sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
function manualServo(pct) {
  document.getElementById('man-val').innerText = pct + "%";
  fetch('/api/manual?val=' + pct);
}

function updVal(id, v, unit) { document.getElementById(id).innerText = v + unit; }
function fmtTime(s) {
  let min = Math.floor(s / 60);
  let sec = Math.floor(s % 60);
  return min + ":" + (sec < 10 ? "0" : "") + sec;
}

function updTimeDisp() {
  if (isRunning) return; 
  const h = parseFloat(document.getElementById('inp-hold').value) || 0.5;
  const r = parseFloat(document.getElementById('inp-reach').value) || 0.5;
  const total = tgtCount * (h + r + 0.3);
  document.getElementById('time-display').innerText = fmtTime(Math.ceil(total));
  // sessionTotalDur = total; // 修正
}

function setCount(n, el) {
  tgtCount = n;
  document.querySelectorAll('.chk-btn').forEach(b => b.classList.remove('active'));
  el.classList.add('active');
  if(!isRunning) updTimeDisp();
}

function setPreset(mode, el) {
  document.querySelectorAll('.preset-btn').forEach(b => b.classList.remove('active'));
  el.classList.add('active');
  currentPresetName = el.getAttribute('data-name');
  
  const s = document.getElementById('inp-str');
  let count = 3;

  if(mode==='soft') { 
    s.value=30; 
    count = 2;
  }
  if(mode==='normal') { 
    s.value=50; 
    count = 3;
  }
  if(mode==='kosen') { 
    s.value=100; 
    count = 5;
  }
  
  updVal('str-disp', s.value, '%');

  tgtCount = count;
  document.querySelectorAll('.chk-btn').forEach(b => {
    if(parseInt(b.innerText) === count) {
      b.classList.add('active');
    } else {
      b.classList.remove('active');
    }
  });

  if(!isRunning) updTimeDisp();
}

function showSettings() {
  document.getElementById('view-main').style.display = 'none';
  document.getElementById('view-settings').style.display = 'block';
  document.getElementById('view-history').style.display = 'none';
}
function showHistory() {
  document.getElementById('view-main').style.display = 'none';
  document.getElementById('view-settings').style.display = 'none';
  document.getElementById('view-history').style.display = 'block';
  fetchHistory();
}
function showMain() {
  document.getElementById('view-settings').style.display = 'none';
  document.getElementById('view-history').style.display = 'none';
  document.getElementById('view-main').style.display = 'block';
}

function fetchHistory() {
    const list = document.getElementById('history-list');
    fetch('/api/history')
        .then(r => r.json())
        .then(data => {
            list.innerHTML = "";
            if(data.length === 0) {
                list.innerHTML = "<div style='padding:20px; text-align:center; color:#888;'>履歴はありません</div>";
                return;
            }
            // 新しい順に表示
            data.reverse().forEach(item => {
                const row = document.createElement('div');
                row.className = 'history-row';
                row.innerHTML = `
                  <div class="h-info">
                     <span class="h-preset">${item.preset}</span>
                     <div class="h-detail">強さ:${item.strength}% / ${item.count}回</div>
                  </div>
                  <div class="h-time">${item.time}</div>
                `;
                list.appendChild(row);
            });
        })
        .catch(e => {
            list.innerHTML = "<div style='color:red; text-align:center;'>読み込みエラー</div>";
        });
}

function start() {
  const s = document.getElementById('inp-str').value;
  
  isManualStop = false;
  isRunning = true;
  document.body.classList.add('running');
  document.getElementById('status-badge').innerText = "準備中..."; 
  
  lastStartAction = Date.now();
  sessionStartTime = lastStartAction;
  
  runPreset = currentPresetName;
  runStrength = s;
  runCount = tgtCount;

  const h = parseFloat(document.getElementById('inp-hold').value) || 0.5;
  const r = parseFloat(document.getElementById('inp-reach').value) || 0.5;
  sessionTotalDur = tgtCount * (h + r + 0.3);
  if(sessionTotalDur < 1) sessionTotalDur = 1;

  // プリセット名も送信
  fetch(`/api/start?str=${s}&cnt=${tgtCount}&preset=${encodeURIComponent(runPreset)}`).catch(()=>{});
}

function stop() { 
  isManualStop = true;
  fetch('/api/stop').catch(()=>{}); 
}

function setOnline(isOnline) {
  if(isOnline) {
    document.body.classList.remove('offline');
  } else {
    document.body.classList.add('offline');
  }
}

// --- SMOOTH ANIMATION LOOP ---
function animateLoop() {
  if (isRunning && sessionTotalDur > 0) {
    const now = Date.now();
    const elapsedSec = (now - sessionStartTime) / 1000;
    const remaining = Math.max(0, sessionTotalDur - elapsedSec);
    
    document.getElementById('time-display').innerText = fmtTime(Math.ceil(remaining));

    let pct = (elapsedSec / sessionTotalDur) * 100;
    if (pct < 0) pct = 0;
    if (pct > 100) pct = 100;
    document.getElementById('yt-fill').style.width = pct + "%";
    
    // 残り時間が0になったら即座に完了処理
    if (remaining <= 0 && !isManualStop) {
      finishSession();
    }
  }
  requestAnimationFrame(animateLoop);
}
requestAnimationFrame(animateLoop);

// --- SYNC WITH SERVER ---
function syncStatus() {
  fetch('/api/status')
    .then(r => r.json())
    .then(d => {
      setOnline(true);
      
      if(d.state !== 'IDLE') {
        if (!isRunning) {
          isRunning = true;
          document.body.classList.add('running');
          sessionStartTime = Date.now() - (d.elap || 0);
        }

        let txt = "動作中";
        if(d.state === 'PREPARE_SQUEEZE') txt = "準備中...";
        if(d.state === 'SQUEEZING') txt = "握り中";
        if(d.state === 'HOLDING') txt = "保持中";
        if(d.state === 'RELEASING') txt = "解放中";
        document.getElementById('status-badge').innerText = `${txt} (${d.cycle+1}/${d.total})`;

        sessionTotalDur = d.dur || 1; 
        const estimatedStart = Date.now() - (d.elap || 0);
        if (Math.abs(estimatedStart - sessionStartTime) > 500) {
           sessionStartTime = estimatedStart;
        }

      } else {
        // IDLEに戻った = 動作完了
        if (isRunning) {
          finishSession();
        }
      }
      lastStatus = d.state;
    })
    .catch(e => {
      setOnline(false);
    });
}
setInterval(syncStatus, 1000);

function finishSession() {
  if (!isRunning) return; // 既に完了済みなら何もしない
  isRunning = false;
  document.body.classList.remove('running');
  document.getElementById('status-badge').innerText = "待機中";
  document.getElementById('yt-fill').style.width = '0%';
  updTimeDisp(); 
  
  if (!isManualStop) {
    showCompletionModal();
  }
  isManualStop = false;
}

function showCompletionModal() {
  const modal = document.getElementById('completion-modal');
  document.getElementById('detail-preset').innerText = runPreset;
  document.getElementById('detail-strength').innerText = runStrength + '%';
  document.getElementById('detail-count').innerText = runCount + '回';
  modal.classList.add('show');
}

function closeCompletionModal() {
  document.getElementById('completion-modal').classList.remove('show');
}

function setAllServos(angle) {
  document.getElementById('all-servo-val').innerText = angle + '°';
  document.getElementById('servo1-val').innerText = angle + '°';
  document.getElementById('servo2-val').innerText = angle + '°';
  document.getElementById('servo3-val').innerText = angle + '°';
  fetch(`/api/servo_all?angle=${angle}`);
}

function setServo(servoNum, angle) {
  document.getElementById(`servo${servoNum}-val`).innerText = angle + '°';
  fetch(`/api/servo_individual?servo=${servoNum}&angle=${angle}`);
}

// 位置補正機能
function updateAngleOffset(value) {
  document.getElementById('offset-disp').innerText = value;
  fetch(`/api/angle_offset?value=${value}`)
    .then(r => r.text())
    .then(d => console.log('Angle Offset updated:', value));
}

// 初期化時に位置補正値を読み込む
function fetchSettings() {
  fetch('/api/angle_offset')
    .then(r => r.json())
    .then(data => {
      const offset = data.angleOffset || 0;
      document.getElementById('inp-offset').value = offset;
      document.getElementById('offset-disp').innerText = offset;
    })
    .catch(e => console.error('Failed to fetch angle offset:', e));
}
</script>
</body>
</html>
)rawliteral";

