sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
void handleApiServoIndividual() {
  if (server.hasArg("servo") && server.hasArg("angle")) {
    int servoNum = server.arg("servo").toInt();
    int angle = server.arg("angle").toInt();
    if (angle < 90)
      angle = 90;
    if (angle > 270)
      angle = 270;

    int us = map(angle, 0, 270, US_AT_0_DEG, US_AT_270_DEG);

    currentState = IDLE;
    stateStartTime = millis();

    if (servoNum == 1) {
      if (!servo1.attached())
        servo1.attach(PIN_SERVO1, US_AT_0_DEG, US_AT_270_DEG);
      servo1.writeMicroseconds(us);
    } else if (servoNum == 2) {
      if (!servo2.attached())
        servo2.attach(PIN_SERVO2, US_AT_0_DEG, US_AT_270_DEG);
      servo2.writeMicroseconds(us);
    } else if (servoNum == 3) {
      if (!servo3.attached())
        servo3.attach(PIN_SERVO3, US_AT_0_DEG, US_AT_270_DEG);
      servo3.writeMicroseconds(us);
    }

    Serial.printf("[API] Servo %d: %d degrees\n", servoNum, angle);
  }
  server.send(200, "text/plain", "OK");
}

void handleApiHistory() {
  String json = "[";
  for (size_t i = 0; i < historyLog.size(); i++) {
    if (i > 0)
      json += ",";
    json += "{";
    json += "\"time\":\"" + historyLog[i].timeStr + "\",";
    json += "\"preset\":\"" + historyLog[i].preset + "\",";
    json += "\"strength\":" + String(historyLog[i].strength) + ",";
    json += "\"count\":" + String(historyLog[i].count);
    json += "}";
  }
  json += "]";
  server.send(200, "application/json", json);
}

void handleApiAngleOffset() {
  if (server.hasArg("value")) {
    // POST: 設定
    int value = server.arg("value").toInt();
    if (value >= -90 && value <= 90) {
      globalAngleOffset = value;
      preferences.putInt("angleOffset", globalAngleOffset);
      Serial.printf("[API] Angle Offset set to: %d\n", globalAngleOffset);
      server.send(200, "text/plain", "OK");
    } else {
      server.send(400, "text/plain", "範囲エラー: -90 ~ +90");
    }
  } else {
    // GET: 取得
    String json = "{";
    json += "\"angleOffset\":" + String(globalAngleOffset);
    json += "}";
    server.send(200, "application/json", json);
  }
}

void handleRoot() {
  String html = html_main;
  html.replace("{{BUILD_TIME}}", __DATE__ " " __TIME__);
  server.send(200, "text/html", html);
}

void setup() {
  Serial.begin(115200);

  preferences.begin("job", false);
  holdTimeSec = preferences.getFloat("hold", 0.5);
  reachTimeSec = preferences.getFloat("reach", 0.5);
  pin13State = preferences.getInt("pin13", 0);
  globalAngleOffset =
      preferences.getInt("angleOffset", 0); // 位置補正を読み込み

  pinMode(13, OUTPUT);

  digitalWrite(13, pin13State ? HIGH : LOW);

  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);

  servo1.setPeriodHertz(50);
  servo2.setPeriodHertz(50);
  servo3.setPeriodHertz(50);

  attachAllServos();
  setAllServosAngle(getRelaxAngle()); // オフセット適用済みの位置で初期化

  // --- AP Mode Setup (Yakisoba-Shiro) ---
  WiFi.disconnect(true);
  delay(100);
  WiFi.mode(WIFI_AP);
  WiFi.softAP("焼きそば四郎"); // No Password

  Serial.print("AP IPs: ");
  Serial.println(WiFi.softAPIP());

  // DNS Server (Captive Portal)
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

  server.on("/", handleRoot);
  server.on("/api/status", handleApiStatus);
  server.on("/api/start", handleApiStart);
  server.on("/api/stop", handleApiStop);
  server.on("/api/settings", handleApiSettings);
  server.on("/api/pin13", handleApiPin13);
  server.on("/api/manual", handleApiManual);
  server.on("/api/manual_angle", handleApiManualAngle);
  server.on("/api/servo_all", handleApiServoAll);
  server.on("/api/servo_individual", handleApiServoIndividual);
  server.on("/api/history", handleApiHistory);
  server.on("/api/angle_offset", handleApiAngleOffset); // 位置補正API

  // Captive Portal Redirect
  server.onNotFound([]() { handleRoot(); });

  server.begin();
  Serial.println("Ready.");
}

void loop() {
  dnsServer.processNextRequest();
  server.handleClient();

  unsigned long now = millis();

  if (currentState != lastState) {
    stateStartTime = now;
    Serial.printf("State: %d\n", currentState);

    if (currentState == PREPARE_SQUEEZE) {
      attachAllServos();
      setAllServosAngle(270);
    }
    lastState = currentState;
  }

  switch (currentState) {
  case IDLE:
    // Auto Detach Removed as per user request
    yield(); // Watchdog reset
    break;

  case PREPARE_SQUEEZE:
    setAllServosAngle(getRelaxAngle());
    if (now - stateStartTime > 300) {
      currentState = SQUEEZING;
    }
    yield(); // Watchdog reset
    break;

  case SQUEEZING: {
    unsigned long duration = reachTimeSec * 1000;
    unsigned long elapsed = now - stateStartTime;
    int startUs = US_AT_270_DEG;
    int targetUs = strengthToUs(targetStrength);

    if (elapsed >= duration) {
      setAllServosUs(targetUs);
      currentState = HOLDING;
    } else {
      float progress = (float)elapsed / (float)duration;
      int currentUs = startUs + (targetUs - startUs) * progress;
      setAllServosUs(currentUs);
    }
    yield(); // Watchdog reset
  } break;

  case HOLDING:
    if (now - stateStartTime >= (holdTimeSec * 1000)) {
      currentState = RELEASING;
    }
    yield(); // Watchdog reset
    break;

  case RELEASING:
    setAllServosAngle(getRelaxAngle());
    if (now - stateStartTime >= 300) {
      currentState = WAIT_CYCLE;
    }
    yield(); // Watchdog reset
    break;

  case WAIT_CYCLE:
    currentCycle++;
    if (currentCycle < targetCount) {
      currentState = SQUEEZING;
    } else {
      Serial.println("Finished.");
      setAllServosAngle(getRelaxAngle());
      currentState = IDLE;

      // --- 履歴保存 ---
      struct tm timeinfo;
      if (!getLocalTime(&timeinfo)) {
        Serial.println("Failed to obtain time");
      } else {
        char timeStringBuff[50];
        strftime(timeStringBuff, sizeof(timeStringBuff), "%Y/%m/%d %H:%M",
                 &timeinfo);

        HistoryItem newItem;
        newItem.timeStr = String(timeStringBuff);
        newItem.preset = currentSessionPreset;
        newItem.strength = targetStrength;
        newItem.count = targetCount;

        historyLog.push_back(newItem);

        // 最大保存件数 (20件)
        if (historyLog.size() > 20) {
          historyLog.erase(historyLog.begin());
        }
      }
      // ----------------
    }
    yield(); // Watchdog reset
    break;
  }
}
